In [2]:
import pandas as pd

In [3]:
import pandas as pd

In [4]:
import pandas as pd

In [5]:
import sys

In [6]:
import numpy as py

In [7]:
import csv

In [8]:
import json

In [9]:
pip install pyarrow

Requirement already satisfied: pyarrow in /Users/lydia/jup_env39/lib/python3.9/site-packages (15.0.2)
Requirement already satisfied: numpy<2,>=1.16.6 in /Users/lydia/jup_env39/lib/python3.9/site-packages (from pyarrow) (1.26.4)
WARNING: You are using pip version 21.2.4; however, version 24.0 is available.
You should consider upgrading via the '/Users/lydia/jup_env39/bin/python -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [10]:
pip install openpyxl==3.1.2

Requirement already satisfied: openpyxl==3.1.2 in /Users/lydia/jup_env39/lib/python3.9/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /Users/lydia/jup_env39/lib/python3.9/site-packages (from openpyxl==3.1.2) (1.1.0)
WARNING: You are using pip version 21.2.4; however, version 24.0 is available.
You should consider upgrading via the '/Users/lydia/jup_env39/bin/python -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [11]:
pip install xlrd

Requirement already satisfied: xlrd in /Users/lydia/jup_env39/lib/python3.9/site-packages (2.0.1)
WARNING: You are using pip version 21.2.4; however, version 24.0 is available.
You should consider upgrading via the '/Users/lydia/jup_env39/bin/python -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [12]:
pip install pytables

ERROR: Could not find a version that satisfies the requirement pytables (from versions: none)
ERROR: No matching distribution found for pytables
WARNING: You are using pip version 21.2.4; however, version 24.0 is available.
You should consider upgrading via the '/Users/lydia/jup_env39/bin/python -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [13]:
pip install lxml beautifulsoup4 html5lib

Requirement already satisfied: lxml in /Users/lydia/jup_env39/lib/python3.9/site-packages (5.2.1)
Requirement already satisfied: beautifulsoup4 in /Users/lydia/jup_env39/lib/python3.9/site-packages (4.12.3)
Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     |████████████████████████████████| 112 kB 3.6 MB/s eta 0:00:01
Requirement already satisfied: soupsieve>1.2 in /Users/lydia/jup_env39/lib/python3.9/site-packages (from beautifulsoup4) (2.5)
Requirement already satisfied: six>=1.9 in /Users/lydia/jup_env39/lib/python3.9/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /Users/lydia/jup_env39/lib/python3.9/site-packages (from html5lib) (0.5.1)
Installing collected packages: html5lib
Successfully installed html5lib-1.1
WARNING: You are using pip version 21.2.4; however, version 24.0 is available.
You should consider upgrading via the '/Users/lydia/jup_env39/bin/python -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

# Chapter 6 <br>
# Data Loading, Storage, and File Formats

### Reading and Writing Data in Text Format

**read_csv** <br>
*Load delimited data from a file, URL, or file-like object; use comma as default delimiter*<br>
**read_fwf**<br>	
*Read data in fixed-width column format (i.e., no delimiters)*<br>
**read_clipboard**<br>	
*Variation of read_csv that reads data from the clipboard; useful for converting tables from web pages*<br>
**read_excel**<br>	
*Read tabular data from an Excel XLS or XLSX file*<br>
**read_hdf**<br>	
*Read HDF5 files written by pandas*<br>
**read_html**<br>	
*Read all tables found in the given HTML document* <br>
**read_json**<br>	
*Read data from a JSON (JavaScript Object Notation) string representation, file, URL, or file-like object* <br>
**read_feather**<br>	
*Read the Feather binary file format* <br>
**read_orc**<br>	
*Read the Apache ORC binary file format* <br>
**read_parquet**<br>	
*Read the Apache Parquet binary file format*<br>
**read_pickle**	<br>
*Read an object stored by pandas using the Python pickle format* <br>
**read_sas**<br>	
*Read a SAS dataset stored in one of the SAS system's custom storage formats*<br>
**read_spss**<br>	
*Read a data file created by SPSS*<br>
**read_sql**<br>	
*Read the results of a SQL query (using SQLAlchemy)*<br>
**read_sql_table**<br>	
*Read a whole SQL table (using SQLAlchemy); equivalent to using a query that selects everything in that table using read_sql*<br>
**read_stata**<br>	
*Read a dataset from Stata file format*<br>
**read_xml**	<br>
*Read a table of data from an XML file*

In [14]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [15]:
df = pd.read_csv("examples/ex1.csv")

In [16]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
!cat examples/exe.csv

cat: examples/exe.csv: No such file or directory

In [18]:
pd.read_csv("examples/ex2.csv", names = ["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
names = ["a", "b", "c", "d", "message"]

In [20]:
pd.read_csv("examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [21]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [22]:
parsed = pd.read_csv("examples/csv_mindex.csv", index_col=["key1", "key2"])

In [23]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [24]:
!cat examples/ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [25]:
result = pd.read_csv("examples/ex3.txt", sep="\\s+")

In [26]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [27]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [28]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [29]:
result = pd.read_csv("examples/ex5.csv")

In [30]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [31]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [32]:
result = pd.read_csv("examples/ex5.csv", na_values=["NULL"])

In [33]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [34]:
result2 = pd.read_csv("examples/ex5.csv", keep_default_na=False)

In [35]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [36]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [37]:
result3 = pd.read_csv("examples/ex5.csv", keep_default_na=False, na_values=["NA"])

In [38]:
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [39]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [40]:
sentinals = {"message": ["foo", "NA"], "something": ["two"]}

In [41]:
pd.read_csv("examples/ex5.csv", na_values=sentinals, keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

# Some Pandas.read_csv Function Arguments<br>	

**path**<br>	
*String indicating filesystem location, URL, or file-like object.*<br>	
**sep or delimiter**	<br>	
*Character sequence or regular expression to use to split fields in each row.*<br>	
**header**	<br>	
*Row number to use as column names; defaults to 0 (first row), but should be None if there is no header row.*<br>	
**index_col**<br>	
*Column numbers or names to use as the row index in the result; can be a single name/number or a list of them for a hierarchical index.*<br>	
**names**	<br>	
*List of column names for result.*<br>	
**skiprows**<br>		
*Number of rows at beginning of file to ignore or list of row numbers (starting from 0) to skip.*<br>	
**na_values**	<br>	
*Sequence of values to replace with NA. They are added to the default list unless keep_default_na=False is passed.*<br>	
**keep_default_na**	<br>	
*Whether to use the default NA value list or not (True by default).*<br>	
**comment**	<br>	
*Character(s) to split comments off the end of lines.*<br>	
**parse_dates**	<br>	
*Attempt to parse data to datetime; False by default. If True, will attempt to parse all columns. Otherwise, can specify a list of column numbers or names to parse. If element of list is tuple or list, will combine multiple columns together and parse to date (e.g., if date/time split across two columns).*<br>	
**keep_date_col**	<br>	
*If joining columns to parse date, keep the joined columns; False by default.
converters	Dictionary containing column number or name mapping to functions (e.g., {"foo": f} would apply the function f to all values in the "foo" column).* <br>	
**dayfirst**	<br>	
*When parsing potentially ambiguous dates, treat as international format (e.g., 7/6/2012 -> June 7, 2012); False by default.* <br>	
**date_parser**	<br>	
*Function to use to parse dates.* <br>	
**nrows**	<br>	
*Number of rows to read from beginning of file (not counting the header).* <br>	
**iterator**	<br>	
*Return a TextFileReader object for reading the file piecemeal. This object can also be used with the with statement.* <br>	
**chunksize**	<br>	
*For iteration, size of file chunks.* <br>	
**skip_footer**	<br>	
*Number of lines to ignore at end of file.* <br>	
**verbose**	<br>	
*Print various parsing information, like the time spent in each stage of the file conversion and memory use information.* <br>	
**encoding** <br>		
*Text encoding (e.g., "utf-8 for UTF-8 encoded text). Defaults to "utf-8" if None.* <br>	
**squeeze**	<br>	
*If the parsed data contains only one column, return a Series.* <br>	
**thousands** <br>		
*Separator for thousands (e.g., "," or "."); default is None.* <br>	
**decimal**	<br>	
*Decimal separator in numbers (e.g., "." or ","); default is ".".* <br>	
**engine**	<br>	
*CSV parsing and conversion engine to use; can be one of "c", "python", or "pyarrow". The default is "c", though the newer "pyarrow" engine can parse some files much faster. The "python" engine is slower but supports some features that the other engines do not.* <br>

### Reading Text Files In Pieces

In [42]:
pd.options.display.max_rows = 10

In [43]:
result = pd.read_csv("examples/ex6.csv")

In [44]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [45]:
pd.read_csv("examples/ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [46]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

In [47]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [48]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

In [49]:
tot = pd.Series([], dtype='int64')
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

In [50]:
tot = tot.sort_values(ascending=False)

In [51]:
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### Writing Data to Text Format

In [52]:
data = pd.read_csv("examples/ex5.csv")

In [53]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [54]:
data.to_csv("examples/out.csv")

In [55]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [56]:
import sys

In [57]:
data.to_csv(sys.stdout, na_rep="Null")

,something,a,b,c,d,message
0,one,1,2,3.0,4,Null
1,two,5,6,Null,8,world
2,three,9,10,11.0,12,foo

In [58]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [59]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

### Writing Data to Text Format

In [60]:
data = pd.read_csv("examples/ex5.csv")

In [61]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [62]:
data.to_csv("examples/out.csv")

In [63]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [64]:
data.to_csv(sys.stdout, sep= "|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [65]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [95]:
data.to_csv(sys.stdout, index=False, header=False)

1,2,3
4,5,6
7,8,9

In [96]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3
4,5,6
7,8,9

### Working with Other Delimited Formats

In [97]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [98]:
import csv

An illustration of basic data wrangling:<br>
Read in the file.

In [70]:
f = open("examples/ex7.csv")

In [71]:
reader = csv.reader(f)

Iterating through the reader like a file yeilds lists of values with an y quote characters removed.

In [72]:
for line in reader: 
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [73]:
f.close()

Read the file into a list of lines:

In [74]:
with open("examples/ex7.csv") as f: 
    lines = list(csv.reader(f))

Split the lines into the header line and the data lines:

In [75]:
header, values = lines[0], lines[1:]

Create a data dictionary of columns using a dict comprehension and the expression zip(*values) (beware, this uses a lot of memory in large files) which transposes the rows to columns.

In [76]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [77]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

To define a new format with a different delimiter, string quoting convention, or line terminator, we could define a simple subclass of csv.Dialect:

In [78]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [79]:
with open("examples/ex7.csv") as f: 
    lines = list(csv.reader(f))
    reader = csv.reader(f, dialect=my_dialect)
    reader = csv.reader(f, delimiter="|")

# CSV Dialect Options<br>
**delimiter**<br><br
*One character string to separate fields; defaults to ","* <br><br>
**lineterminator** <br><br
*Line terminator for writing; defaults to "\rn\". Reader ignores this and recognizes cross-platform line terminators."* <br><br>
**quotechar** <br>
*Quote character for fields with special characters (like the delimiter); default is '"'* <br><br>
*quoting* <br><br
*Quoting convention. Options include csv.QUOTE_ALL (quote all fields), csv.QUOTE_MINIMAL (only fields with special characters like the delimiter), csv.QUOTE_NONNUMERIC, and CSV.QUOTE_NONE (no quoting). See Python documentation for full details. Defaults to QUOTE_MINIMAL.*<br><br>
**skipinitialspace**<br>
*Ignore whitespace after each delimiter; default is False.*<br><br>
**doublequote**<br>
*How to handle quoting character inside a field; if True, it is doubled (see online documentation for full detail and behavior).* <br><br>
**escapechar** <br>
*String to escape the delimiter if quoting is set to csv.QUOTE_NONE; disabled by default*<br>

In [80]:
with open("mydata.csv", "w") as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(("one", "two", "three"))
    writer.writerow(("1", "2", "3"))
    writer.writerow(("4", "5", "6"))
    writer.writerow(("7", "8", "9"))

### JSON Data

This is the creation of a JSON object:

In [81]:
obj = """
{"name": "Wes", 
"cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], 
"pet": null,
"siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
             {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [82]:
import json

To convert JSON to Python:

In [83]:
result= json.loads(obj)

In [84]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

To convert Python object back to JSON:

In [85]:
asjson = json.dumps(result)

In [86]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

You can pass a list of dicts(previously JSON objects) to the DataFrame constructor and select a subset of the data fields

In [87]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [88]:
siblings

    name  age
0  Scott   34
1  Katie   42

How you convert a JSON object or list of objects to a DataFrame or some other data

In [89]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

The default options for pandas.read_json assume that each object in the JSON aray is a row in the table:

In [90]:
data = pd.read_json("examples/example.json")

In [91]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [92]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

One way to export data from pandas to JSON is use to_json methods on Series and DataFrame

In [93]:
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML and HTML: Web Scraping

In [99]:
tables = pd.read_html("examples/fdic_failed_bank_list.html")

In [100]:
len(tables)

1

In [101]:
failures = tables[0]

In [102]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [103]:
close_timestamps = pd.to_datetime(failures["Closing Date"])

In [104]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

In [105]:
from lxml import objectify

In [106]:
path = "examples/mta_perf copy/Performance_MNR.xml"

In [107]:
with open(path) as f:
    parsed = objectify.parse(f)
    root = parsed.getroot()

In [ ]:
data = []

In [ ]:
skip_fields = ["PARENT_SEQ", "INDICATOR_SEQ",
              "DESIRED_CHANGE", "DECIMAL_PLACES"]

In [ ]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [ ]:
perf = pd.DataFrame(data)

In [ ]:
perf.head()

In [ ]:
perf2 = pd.read_xml(path)

In [ ]:
perf2.head()

For more complex XML docs, refer to doctring for pandas.read_xml

# Binary Data Formats

In [108]:
frame = pd.read_csv("examples/ex1.csv")

Pickling stores or *serializes* data to binary format

In [109]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [110]:
frame.to_pickle("examples/frame_pickle")

Pickle files are only readable by python. Short term storage only, unstable over time, as new versions of the library.pandas won't necessarily unpickle the file. You can use built-in pickle directly or pandas.read_pickle:

fec = pd.read_parquet('examples/fec copy/fec.parquet')

### Reading Microsoft Excel Files

In [111]:
xlsx = pd.ExcelFile("examples/ex1.xlsx")

In [112]:
xlsx.sheet_names

['Sheet1']

In [113]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [ ]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

If you are reading multiple sheets in a file it is faster to create a pandas.ExcelFile, but you can also just pass the filename to pands.read_excel:

In [ ]:
frame = pd.read_excel("examples/ex1.xlsx", sheet_name="Sheet1")

In [ ]:
frame

To write pandas data to Excel format, you must first create an ExcelWriter, then write the data to it using the Pandas object's to_excel method:

In [ ]:
writer = pd.ExcelWriter("examples/ex2.xlsx")

In [ ]:
frame.to_excel(writer, "Sheet1")

In [ ]:
writer.close

In [ ]:
frame.to_excel("examples/ex2.xlsx")

### Using HDF5 Format

store["obj1_col"] = frame["a"]

store

store["obj1"]

HDFStore supports two storage schemas, "fixed" and "table". The default is "fixed". The latter is generally slower, but it supports query operations using a special syntax:

### Interacting with Web APIs

In [114]:
pip install requests

Requirement already satisfied: requests in /Users/lydia/jup_env39/lib/python3.9/site-packages (2.31.0)
Requirement already satisfied: idna<4,>=2.5 in /Users/lydia/jup_env39/lib/python3.9/site-packages (from requests) (3.6)
Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/lydia/jup_env39/lib/python3.9/site-packages (from requests) (2.2.1)
Requirement already satisfied: certifi>=2017.4.17 in /Users/lydia/jup_env39/lib/python3.9/site-packages (from requests) (2024.2.2)
Requirement already satisfied: charset-normalizer<4,>=2 in /Users/lydia/jup_env39/lib/python3.9/site-packages (from requests) (3.3.2)
WARNING: You are using pip version 21.2.4; however, version 24.0 is available.
You should consider upgrading via the '/Users/lydia/jup_env39/bin/python -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [115]:
import requests

/Users/lydia/jup_env39/lib/python3.9/site-packages/urllib3/__init__.py:35: NotOpenSSLWarning: urllib3 v2 only supports OpenSSL 1.1.1+, currently the 'ssl' module is compiled with 'LibreSSL 2.8.3'. See: https://github.com/urllib3/urllib3/issues/3020
  warnings.warn(

In [116]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [117]:
resp = requests.get(url)

In [118]:
resp.raise_for_status()

In [119]:
resp

In [120]:
data = resp.json()

In [121]:
data[0]["title"]

'BUG: fix aggregation when using udf with kwarg'

In [122]:
issues = pd.DataFrame(data, columns=["number", "title", "labels", "state"])

In [123]:
issues

,number,title,labels,state
0,58170,BUG: fix aggregation when using udf with kwarg,[],open
1,58169,ENH: New proposed deprecation policy,[],open
2,58166,TST: Use temp_file fixture over ensure_clean,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
3,58165,PERF: more realistic np datetime c benchmark,[],open
4,58164,BUILD: C code coverage,[],open
...,...,...,...,...
25,58131,BUG: read_csv file handle not closed after error,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,58130,BUG: Integers with extreme values are incorrec...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,58129,Convert result of group by agg to pyarrow if i...,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
28,58128,"When excel cell with 0x005F_FFFF, pandas read ...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,58125,CLN: enforce deprecation of the `kind` keyword...,[],open

### Interacting with Databases

In [124]:
import sqlite3

In [125]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);"""

In [126]:
con = sqlite3.connect("mydata.sqlite")

con.execute(query)

In [128]:
con.commit()

In [129]:
data = [("Atlanta", "Georgia",1.25,6),
       ("Tallahassee","Florida",2.6,3),
       ("Sacremento","California",1.7,5)]

In [130]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [131]:
con.executemany(stmt, data)

In [132]:
con.commit()

In [133]:
cursor = con.execute("SELECT * FROM test")

In [134]:
rows=cursor.fetchall()

In [135]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacremento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacremento', 'California', 1.7, 5)]

In [136]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [139]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacremento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacremento  California  1.70  5

In [140]:
import sqlalchemy as sqla

In [141]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [142]:
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacremento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacremento  California  1.70  5